[
    {
        "name": "Kristin Miller",
        "rating": 5,
        "comment": "Took my import car in for an oil change, and overall inspection of the engine. Ryan was thorough and took the time to explain to me what he reviewed. The front desk assistant greeted me upon arrival and personalized the experience for me with her professionalism and follow-up.  I definitely will return to Axis Motor Werks!"
    },
    {
        "name": "Tim Sweeney",
        "rating": 5,
        "comment": "While on a road trip from California, I received an overheating message on my 2015 X3. I brought the car to Axis. The staff were very knowledgable, professional and friendly. They looked at my car right away and deduced the problem. I was in and out within 15 minutes with confidence that the X3 was fixed. I had no further problems with the car while driving back to California. Thanks Axis!"
    },
    {
        "name":"Geneviève Poirier",
        "rating": 5,
        "comment":"Vanlifer's driving trough a sand storm and had no more Turbo power with our Mercedes Sprinter Van, Ryan quickly cleaned our air filter full of Sand and fixed the check engine notification. On a trip, from Canada I gave a hug to Ryan. Thank you so Much Ryan we Will be able to return to Canada."
    },
    {
        "name":"Scott Naramore",
        "rating": 5,
        "comment":"Recently had my wife’s BMW X5 completely serviced with Axis Motor Werks. Ryan was spot on with cost and time frame. I highly recommend Axis Motor Werks located at 1105 N 1st Street."
    },
    {
        "name":"Tyler Goodman",
        "rating": 5,
        "comment":"Had my truck in to do some routine maintenance and couldn’t be more pleased with the experience. Great communication on timing, thorough inspection with clear explanation on upcoming items to consider in the future, and a generally friendly staff. Highly recommended!"
    },
    {
        "name":"Mike Schleich",
        "rating": 5,
        "comment":"Fast service at a great price, Ryan really knows what he is doing!"
    },
    {
        "name":"Vicky Bray",
        "rating": 5,
        "comment":"One of a kind! Unmatched customer service level & experience. A car shop you can trust!"
    },
    {
        "name":"G McKee",
        "rating": 5,
        "comment":"We are on a long trip from Canada and our Sprinter van with Mercedes engine was going limp and check engine light coming on on the hot climbs up Mesas north through Arizona and Utah. Axis Motorwerks was the only place we found in the entire Moab region that could do the work. What a great place! Ryan really knows his stuff and expertly tracked down the problem, got the parts and fixed it with clear explanations. Betsy and Ryan provided fabulous customer service and an accurate cost estimate. Well worth the drive to Grand Junction. They saved our trip.  We’d use Axis Motorwerks as our regular mechanic if we could and highly recommend this excellent mechanic and  business."
    }
]